function f = ex2(a, b, m, n)
    % Возвращает function handle для нечетной кусочно-линейной функции
    %     a, b - интервальные точки кусочно-линейной функции
    %     m, n - произвольные константы для горизонтальных участков
    % Использование:
    %     x = -10 : 0.01 : 10; % диапазон значений x
    %     f = ex2(a, b, m, n); % получение function handle
    %     y = f(x);            % вычисление значений функции

    
    k = m / a;  % наклон для линейного участка

    f = @(x) (-a <= x      &      x <= a) .* (k * x) + ...
             ( a  < abs(x) & abs(x) <= b) .* (m * sign(x)) + ...
             ( b  < abs(x)              ) .* (n * sign(x));
end