#!/bin/bash
# Скрипт для компиляции LaTeX-проекта с помощью Docker.
# Использование: ./compile.sh reports/имя_папки_с_работой

###################################################################################################
# Перед первым использованием в Linux/macOS/WSL сделайте скрипт исполняемым: chmod +x compile.sh. #
###################################################################################################

if [ -z "$1" ]; then
    echo "Ошибка: Укажите путь к папке с работой."
    exit 1
fi

FILENAME=${2:-_report.tex}

# --- АВТОМАТИЧЕСКАЯ ОЧИСТКА ---
echo "Очищаю временные файлы в папке $1..."
rm -f "$1"/*.aux "$1"/*.log "$1"/*.out "$1"/*.toc "$1"/*.fls "$1"/*.fdb_latexmk
# --- КОНЕЦ БЛОКА ОЧИСТКИ ---

IMAGE_NAME="latex-compiler-env"
# ... (проверка и сборка образа) ...

echo "Запускаю компиляцию файла $FILENAME в папке: $1"

docker run --rm \
    -u "$(id -u):$(id -g)" \
    -v "$(pwd)":/workdir \
    -e "TEXINPUTS=/workdir//:" \
    -w /workdir/"$1" \
    $IMAGE_NAME lualatex -interaction=batchmode "$FILENAME"

echo "Компиляция завершена. PDF-файл должен находиться в папке $1. Если его там нет, см. .log файл для нахождения ошибок (в терминале они не печатаются)."