# Исходные данные, полученные в ходе эксперимента
# Все линейные размеры указаны в сантиметрах (см)

p = {
    # Дерево, сжатие вдоль волокон
    'wood_along': {
        'before': {'a': 2.05, 'b': 1.80, 'h': 2.40},
        'after':  {'a': 2.05, 'b': 1.80, 'h': 2.40} # Размеры после условные, т.к. происходит разрушение
    },
    # Дерево, сжатие поперек волокон
    'wood_across': {
        'before': {'a': 1.65, 'b': 2.40, 'h': 1.90},
        'after':  {'a': 1.65, 'b': 2.40, 'h': 1.90} # Размеры после условные
    },
    # Пластик
    'plastic': {
        'before': {'a': 0.95, 'b': 0.95, 'h': 1.95},
        'after':  {'a': 2.20, 'b': 2.20, 'h': 0.32}
    }
}

# Характерные нагрузки, определенные по диаграммам сжатия
# Все нагрузки указаны в килоньютонах (кН)
loads = {
    # Дерево вдоль волокон (хрупкое разрушение)
    'P_max_wood_along': 29,  # Максимальная нагрузка (предел прочности)

    # Дерево поперек волокон (пластическое поведение)
    'P1_wood_across': 4,   # Нагрузка, соответствующая пределу пропорциональности/текучести
    'Pk_wood_across': 50,   # Нагрузка в момент прекращения опыта (максимальная на графике)

    # Пластик (пластическое поведение)
    'Pt_plastic': 2,       # Нагрузка, соответствующая пределу текучести
    'Pk_plastic': 50        # Нагрузка в момент прекращения опыта
}